-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2021-05-05 22:35:37
-- 服务器版本： 5.7.26
-- PHP 版本： 7.3.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `testtest`
--

-- --------------------------------------------------------

--
-- 表的结构 `movies`
--

CREATE TABLE `movies` (
  `id` varchar(10) NOT NULL,
  `title` varchar(255) NOT NULL,
  `director` varchar(255) NOT NULL,
  `actor` varchar(255) NOT NULL,
  `duration` varchar(4) NOT NULL,
  `type` varchar(255) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `movies`
--

INSERT INTO `movies` (`id`, `title`, `director`, `actor`, `duration`, `type`) VALUES
('1291936', '攻壳机动队', '押井守', '田中敦子', '83', '动作,科幻,动画'),
('1292344', '十二罗汉', '史蒂文・索德伯格', '乔治・克鲁尼', '125', '犯罪,惊悚'),
('1292371', '四月物语', '岩井俊二', '松隆子', '67', '爱情'),
('1293839', '罗马假日', '威廉・惠勒', '奥黛丽・赫本', '118', '喜剧,剧情,爱情'),
('1301164', '基地疑云', '约翰・麦克蒂尔南', '约翰・特拉沃尔塔', '98', '犯罪,剧情,悬疑,惊悚'),
('1309103', '神奇四侠', '蒂姆・斯托瑞', '艾恩・格拉法德', '106', '动作,科幻,冒险'),
('1418189', '蜘蛛侠3', '山姆・雷米', '托比・马奎尔', '139', '动作,科幻,冒险'),
('1473074', '古惑仔2之猛龙过江', '刘伟强', '郑伊健', '101', '动作,剧情'),
('1482394', '蓝色生死恋', '尹锡湖', '宋承宪', '53', '剧情,爱情'),
('1861411', '好奇害死猫', '张一白', '刘嘉玲', '93', '剧情,爱情,悬疑,惊悚'),
('1997679', '木乃伊3', '罗伯・科恩', '布兰登・费舍', '112', '动作,冒险,奇幻,惊悚'),
('2124708', '形影不离', '伍仕贤', '凯文・史派西', '97', '剧情,悬疑'),
('2255999', '神枪手与智多星', '姜国民', '吴镇宇', '94', '动作,喜剧,犯罪'),
('2256038', '5颗子弹', '魏时煜', '刘佩琦', '95', '剧情,犯罪'),
('2373638', '隔离区', '约翰・埃里克・道达尔', '哥伦布・绍特', '89', '恐怖,悬疑,惊悚'),
('3143676', '林中小屋', '德鲁・高达', '克里斯汀・康奈利', '95', '恐怖'),
('3217142', '通灵神探', '阿方索・博亚尔特', '安东尼・霍普金斯', '100', '科幻,犯罪,悬疑,惊悚'),
('3266407', '超强台风', '冯小宁', '巫刚', '93', '剧情,科幻,灾难'),
('3621418', '机动部队―人性', '吴耀权', '任达华', '88', '犯罪,剧情,惊悚'),
('3637228', '高空飞行', '卡里・安德鲁斯', '兰登・莱伯隆', '90', '悬疑,惊悚,灾难'),
('3660133', '偏执', '罗伯特・路克蒂克', '利亚姆・海姆斯沃斯', '100', '剧情,动作,惊悚,犯罪'),
('3731463', '罪与罚', '周显扬', '郭富城', '120', '犯罪,剧情,悬疑'),
('3928370', '越光宝盒', '刘镇伟', '孙俪', '86', '喜剧,爱情,奇幻,古装'),
('4728518', '人山人海', '蔡尚君', '陈建斌', '91', '剧情,悬疑,犯罪'),
('4729828', '惨死', 'Manussa Vorasingha', '麦察蓉普拉', '104', '恐怖,惊悚'),
('4735944', '龙凤店', '钟澍佳', '徐熙媛', '108', '喜剧,爱情,古装'),
('5194471', '画壁', '陈嘉上', '邓超', '122', '剧情,动作,爱情,奇幻'),
('5327268', '荒野猎人', '亚历杭德罗・冈萨雷斯・伊纳里图', '莱昂纳多・迪卡普里奥', '156', '剧情,动作,冒险'),
('5364905', '天机・富春山居图', '孙健君', '刘德华', '122', '动作,冒险'),
('5364987', '孤岛惊魂', '钟继昌', '陈小春', '100', '悬疑,惊悚,恐怖'),
('5919324', 'B区32号', '吕建民', '邓紫衣', '89', '剧情,惊悚,恐怖'),
('5992886', '致命请柬', '孙小光', '张达明', '95', '剧情,悬疑,惊悚,恐怖,鬼怪'),
('6307966', '弗兰肯斯坦的军队', '理查德・拉帕索尔斯', '卡瑞尔・罗登', '85', '动作,科幻,惊悚'),
('6560058', '雷神2：黑暗世界', '阿兰・泰勒', '克里斯・海姆斯沃斯', '112', '动作,奇幻,冒险'),
('6753096', '床下有人', '牛朝阳', '郭晓然', '100', '悬疑,惊悚'),
('6874741', '无问西东', '李芳芳', '章子怡', '138', '剧情,爱情,战争'),
('6875611', '破坏者', '大卫・阿耶', '阿诺・施瓦辛格', '104', '剧情,动作,犯罪,惊悚'),
('6878446', '二次曝光', '李玉', '范冰冰', '106', '剧情,爱情,悬疑'),
('6982558', '长城', '张艺谋', '马特・达蒙', '104', '动作,奇幻,冒险'),
('7005155', '魅妆', '陈健', '应采儿', '100', '悬疑,惊悚'),
('10604087', '控制', '毕国智', '吴彦祖', '92', '动作,科幻,犯罪,悬疑'),
('10604486', '不二神探', '王子鸣', '文章', '98', '喜剧,动作,犯罪'),
('10746430', '阿修罗', '佐藤敬一', '野泽雅子', '76', '动画,恐怖,历史'),
('11600078', '目击者之追凶', '程伟豪', '庄凯勋', '117', '犯罪,悬疑,惊悚'),
('11632586', '爱情银行', '曲江涛', '夏雨', '94', '剧情,爱情'),
('19944106', '美人鱼', '周星驰', '邓超', '93', '喜剧,爱情,奇幻'),
('20279749', '制服', '王光利', '任达华', '91', '犯罪'),
('20376577', '小时代', '郭敬明', '杨幂', '116', '剧情,喜剧,爱情'),
('20380318', '孤岛惊魂2', '钟继昌', '邓家佳', '93', '悬疑,惊悚,恐怖'),
('20470093', '导火新闻线', '方俊华', '梁小冰', '50', '剧情'),
('20513060', '三更车库', '周耀武', '方力申', '86', '悬疑,惊悚,恐怖'),
('21339675', '一吻定情', '永田琴', '矢作穗香', '50', '剧情,喜剧,爱情'),
('24852545', '爱情公寓', '韦正', '陈赫', '117', '喜剧,冒险'),
('24879858', '分手大师', '邓超', '邓超', '116', '喜剧,爱情'),
('25662337', '惊天魔盗团2', '朱浩伟', '杰西・艾森伯格', '130', '剧情,犯罪,悬疑'),
('25709273', '痞子英雄2：黎明升起', '蔡岳勋', '赵又廷', '126', '剧情,动作,犯罪'),
('25742299', '暴疯语', '李光耀', '刘青云', '99', '悬疑,惊悚'),
('25745752', '左耳', '苏有朋', '陈都灵', '117', '剧情,爱情'),
('25810920', '潜龙风云', '李保樟', '蔡卓妍', '100', '剧情,爱情,犯罪'),
('25837175', '谜城', '林岭东', '古天乐', '105', '动作,犯罪,惊悚'),
('25849599', '全城通缉', '汪涛', '刘烨', '104', '剧情,悬疑'),
('25872931', '万物生长', '李玉', '范冰冰', '105', '喜剧,爱情'),
('25881780', '命中注定', '张皓', '汤唯', '113', '喜剧,爱情'),
('25908042', '横冲直撞好莱坞', '蒂姆・肯德尔', '赵薇', '118', '喜剧,动作,冒险'),
('25969095', '秘术', '吴兵', '安以轩', '83', '悬疑,惊悚,冒险'),
('26235346', '犯罪现场', '冯志强', '古天乐', '105', '犯罪,悬疑,惊悚'),
('26289126', '坏蛋必须死', '孙皓', '陈柏霖', '104', '喜剧,动作,犯罪,悬疑'),
('26290642', '致青春・原来你还在这里', '周拓如', '吴亦凡', '98', '剧情,爱情'),
('26315270', '冰河追凶', '徐伟', '梁家辉', '102', '动作,犯罪,悬疑'),
('26352592', '我杀死了巨人', '安德斯・瓦尔特', '麦迪逊・沃尔夫', '106', '剧情,奇幻,惊悚'),
('26367602', '龙牌之谜', '伊哥・斯坦普陈科', '成龙', '120', '动作,奇幻,冒险'),
('26416155', '汽车人总动员', '卓建荣', '刘馨萱', '85', '喜剧,动画,冒险'),
('26426194', '巨齿鲨', '乔・德特杜巴', '杰森・斯坦森', '115', '动作,科幻,惊悚'),
('26430099', '轩辕剑传奇', '李智', '陈龙', '95', '动作,奇幻,冒险'),
('26581837', '上海堡垒', '滕华涛', '鹿晗', '107', '爱情,战争,科幻'),
('26605946', '毒。诫', '刘国昌', '刘青云', '100', '剧情,动作,犯罪'),
('26612285', '谜巢', '金波・兰道', '李冰冰', '90', '动作,冒险'),
('26662192', '王牌逗王牌', '王晶', '刘德华', '102', '喜剧,动作,冒险'),
('26662193', '前任3：再见前任', '田羽生', '韩庚', '120', '喜剧,爱情'),
('26677141', '伊阿索密码', '张楠', '梁静', '88', '科幻,悬疑,惊悚'),
('26683723', '后来的我们', '刘若英', '井柏然', '120', '剧情,爱情'),
('26694683', '笔仙撞碟仙', '摩撒利', '姜星丘', '90', '惊悚,恐怖'),
('26715845', '黑暗迷宫', '温河', '聂远', '97', '犯罪,悬疑'),
('26744597', '云南虫谷', '非行', '蔡珩', '110', '动作,奇幻,冒险'),
('26752547', '催眠・裁决', '刘永泰', '张家辉', '94', '犯罪,悬疑'),
('26764514', '末日重启', '提姆・斯密特', '丹・史蒂文斯', '91', '动作,科幻'),
('26774722', '心理罪之城市之光', '徐纪周', '邓超', '124', '动作,犯罪,悬疑'),
('26881141', '首杀', '史蒂芬・C・米勒', '海登・克里斯滕森', '97', '动作,惊悚'),
('26882457', '断片之险途夺宝', '郭爽', '葛优', '95', '喜剧,冒险'),
('26924351', '断魂小丑', '达米安・利昂', '珍娜・凯内尔', '82', '惊悚,恐怖'),
('26958070', '通灵姐妹', '摩撒利', '张蓝艺', '90', '惊悚,恐怖'),
('26975750', '推理笔记', '林清振', '张子枫', '24', '犯罪,悬疑'),
('27003615', '怨灵宿舍之人偶老师', '陆诗雷', '谢容儿', '90', '惊悚,恐怖'),
('27018354', '金蝉脱壳3：恶魔车站', '约翰・赫兹菲尔德', '西尔维斯特・史泰龙', '87', '动作,犯罪'),
('27037539', '这就是命', '王丹', '王迅', '98', '喜剧,犯罪'),
('30175276', '环大西洋2', '贾瑞德・科恩', '斯蒂夫・理查德・哈里斯', '85', '动作,科幻'),
('30175306', '追龙Ⅱ', '关智耀', '梁家辉', '103', '剧情,动作,犯罪'),
('30192287', '把哥哥退货可以吗？', '维塔亚・东俞扬', '桑尼・苏瓦美塔农', '123', '喜剧,爱情'),
('30198715', '吹哨人', '薛晓路', '雷佳音', '139', '剧情,犯罪,悬疑'),
('30208010', '名侦探柯南：绀青之拳', '永冈智佳', '高山南', '110', '动画,悬疑'),
('30331959', '黑水', '托德・海因斯', '马克・鲁弗洛', '126', '剧情'),
('30362186', '大约在冬季', '王维明', '马思纯', '125', '剧情,爱情'),
('30371775', '恶之华', '井口升', '伊藤健太郎', '127', '剧情,爱情,惊悚'),
('30487218', '租房惊魂', '戴夫・弗兰科', '丹・史蒂文斯', '88', '惊悚,恐怖'),
('33417046', '宠爱', '杨子', '于和伟', '108', '剧情,喜剧,爱情'),
('34443566', '咒怨：诅咒之家', '三宅唱', '荒川良良', '30', '恐怖'),
('35064992', '王牌对王牌 第六季', '吴彤', '沈腾', '120', '真人秀');

--
-- 转储表的索引
--

--
-- 表的索引 `movies`
--
ALTER TABLE `movies`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
